Конфигурация отчетов/InformationRegisters/ЗаказыКухни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыКухни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныПриготовления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/ЗаказыКухни/Ext/ManagerModule.bsl
Функция ЦехПоИдЗаказа(Ид_заказа, Заведение) Экспорт 
	                          
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыКухни.Заведение КАК Заведение,
		|	ЗаказыКухни.Цех КАК Цех,
		|	ЗаказыКухни.НомерСчета КАК НомерСчета
		|ИЗ
		|	РегистрСведений.ЗаказыКухни КАК ЗаказыКухни
		|ГДЕ
		|	ЗаказыКухни.Заведение = &Заведение
		|	И ЗаказыКухни.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("НомерСчета", Ид_заказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Цех;
	
КонецФункции
